/**
 * @format
 * @file AntdFontColors 字体颜色
 * @author 由 fe6 自动生成
 */

import { IIconProps, IconWrapper } from '../runtime';

// 获取 SVG 的 HTML 字符串
export const getIconAntdFontColorsSvgHtml = (props: IIconProps) =>
  `<?xml version="1.0" encoding="UTF-8"?>
<svg width="${props.size}" height="${props.size}" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
  <rect width="48" height="48" fill="white" fill-opacity="0.01"/>
  <path fill="${props.colors?.[0]}" d="M47.52,42.24 L0.48,42.24 C0.216,42.24 0,42.456 0,42.72 L0,47.52 C0,47.784 0.216,48 0.48,48 L47.52,48 C47.784,48 48,47.784 48,47.52 L48,42.72 C48,42.456 47.784,42.24 47.52,42.24 Z M8.502,37.44 L13.602,37.44 C13.854,37.44 14.082,37.278 14.16,37.032 L17.382,27.072 L30.534,27.072 L33.726,37.032 C33.804,37.272 34.026,37.44 34.284,37.44 L39.63,37.44 C39.696,37.44 39.762,37.428 39.822,37.41 C39.9688013,37.3596285 40.0894028,37.2527088 40.1570031,37.1130015 C40.2246034,36.9732942 40.2336023,36.8123732 40.182,36.666 L27.696,0.396 C27.6130903,0.161423171 27.3927749,0.00337085069 27.144,0 L21.006,0 C20.754,0 20.532,0.156 20.454,0.396 L7.95,36.666 C7.926,36.726 7.91989971,36.792 7.91989971,36.858 C7.914,37.176 8.178,37.44 8.502,37.44 L8.502,37.44 Z M23.856,6.474 L24.102,6.474 L29.13,22.302 L18.774,22.302 L23.856,6.474 L23.856,6.474 Z"/>
</svg>`;

// 默认导出组件
export default IconWrapper(
  'antd-font-colors',
  false,
  getIconAntdFontColorsSvgHtml,
);
