/**
 * @format
 * @file AntdBarChart 柱形图表
 * @author 由 fe6 自动生成
 */

import { IIconProps, IconWrapper } from '../runtime';

// 获取 SVG 的 HTML 字符串
export const getIconAntdBarChartSvgHtml = (props: IIconProps) =>
  `<?xml version="1.0" encoding="UTF-8"?>
<svg width="${props.size}" height="${props.size}" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
  <rect width="48" height="48" fill="white" fill-opacity="0.01"/>
  <path fill="${props.colors?.[0]}" d="M47.5,39.5 L4.5,39.5 L4.5,0.5 C4.5,0.225 4.275,0 4,0 L0.5,0 C0.225,0 0,0.225 0,0.5 L0,43.5 C0,43.775 0.225,44 0.5,44 L47.5,44 C47.775,44 48,43.775 48,43.5 L48,40 C48,39.725 47.775,39.5 47.5,39.5 Z M10,34.5 L13.5,34.5 C13.775,34.5 14,34.275 14,34 L14,25 C14,24.725 13.775,24.5 13.5,24.5 L10,24.5 C9.725,24.5 9.5,24.725 9.5,25 L9.5,34 C9.5,34.275 9.725,34.5 10,34.5 Z M19.5,34.5 L23,34.5 C23.275,34.5 23.5,34.275 23.5,34 L23.5,14 C23.5,13.725 23.275,13.5 23,13.5 L19.5,13.5 C19.225,13.5 19,13.725 19,14 L19,34 C19,34.275 19.225,34.5 19.5,34.5 Z M29,34.5 L32.5,34.5 C32.775,34.5 33,34.275 33,34 L33,18.875 C33,18.6 32.775,18.375 32.5,18.375 L29,18.375 C28.725,18.375 28.5,18.6 28.5,18.875 L28.5,34 C28.5,34.275 28.725,34.5 29,34.5 Z M38.5,34.5 L42,34.5 C42.275,34.5 42.5,34.275 42.5,34 L42.5,9 C42.5,8.725 42.275,8.5 42,8.5 L38.5,8.5 C38.225,8.5 38,8.725 38,9 L38,34 C38,34.275 38.225,34.5 38.5,34.5 Z"/>
</svg>`;

// 默认导出组件
export default IconWrapper('antd-bar-chart', false, getIconAntdBarChartSvgHtml);
